In [ ]:
import pandas as pd
import random
df = pd.read_excel('score.xlsx', index_col='지원번호')

In [ ]:
### 특정셀 부분을 수정
df.loc['1번', '요일'] = 5
df.iloc[1, 9] = 2

## 컬럼 전체를 수정
df['요일'] = 5

In [15]:
for i in range(8):
  df.iloc[i, 9] = random.randint(0, 6)

In [17]:
def func(x):
  if x == 0: return '일요일'
  elif x == 1: return '월요일'
  elif x == 2: return '화요일'
  elif x == 3: return '수요일'
  elif x == 4: return '목요일'
  elif x == 5: return '금요일'
  else: '토요일'

In [ ]:
df['요일'].apply(func)

지원번호
1번    화요일
2번    수요일
3번    목요일
4번    일요일
5번    목요일
6번    월요일
7번    월요일
8번    목요일
Name: 요일, dtype: object

In [19]:
df['요일'] = df['요일'].apply(func)

In [ ]:
## 결과컬럼 생성
df['결과'] = '불합격'

## 국어점수가 60점이상이면 합격으로 수정
filt = df['국어'] > 60
df.loc[filt, '결과'] = '합격'

In [ ]:
## 학교 + 등학교
df['학교'] = df['학교'] + '등학교'
## 키 + 'cm' / astype() 타입 변경 후 문자열 + 문자열
df['키'] = df['키'].astype(str) + 'cm'

- 컬럼이 숫자가 아니면 실행이 안됨
- mean(), max(), min(), std()

In [36]:
# df.groupby('학교')['이름'].count()
df.groupby('학교')['국어'].mean()
df.groupby('학교')['국어'].count()
df.groupby('학교')['국어'].sum().sort_values(ascending=False)

학교
구로고     265
디지털고    235
Name: 국어, dtype: int64

In [40]:
df.groupby(['학교', '학년'])['국어'].agg(['mean', 'min', 'max', 'sum'])

         mean  min  max  sum
학교   학년
구로고  1   27.5   15   40   55
     2   80.0   80   80   80
     3   65.0   40   90  130
디지털고 2   77.5   55  100  155
     3   80.0   80   80   80

In [38]:
df['학년'] = [3, 3, 2, 1, 1, 3, 2, 2]

In [41]:
df = pd.read_csv('chipotle.tsv', sep='\t')

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [47]:
df = pd.read_csv('drinks.csv')

In [50]:
df.shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

In [52]:
### 모든 술의 총량을 출력
### total_servings 컬럼을 구하시오. bear + spirit, wine
### 전체 알코올 도수를 확인

### 
df['total_servings'] = df['beer_servings'] + df['spirit_servings'] + df['wine_servings']

In [53]:
df['continent'].unique()

array(['AS', 'EU', 'AF', nan, 'SA', 'OC'], dtype=object)

In [59]:
filt = df['continent'].isnull()
df.loc[filt, 'total_servings'].sum()

np.int64(7721)

In [ ]:
### continent(대륙): NaN 값을 OT로 변경
df['continent'] = df['continent'].fillna('OT')

In [54]:
### 대륙별 total_servings를 구하시오
df.groupby('continent')['total_servings'].sum().sort_values()

continent
OC     2940
SA     4227
AS     4706
AF     4986
EU    21085
Name: total_servings, dtype: int64

In [61]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent', 'total_servings'],
      dtype='object')

In [ ]:
### 술 소비량 대비 알콜 비율이 어느정도 되는지 출력
### 알코올 비율을 계산해서 alcohol_rate 컬럼을 추가
### total_litres_of_pure_alcohol 알코올 비율을 total_servings 으로 나눈 것
df['alcohol_rate'] = df['total_litres_of_pure_alcohol'] / df['total_servings']
df['alcohol_rate'].fillna(0, inplace=True)
### 술 소비량 대비 알콜 비율이 높은 나라별 20개를 출력
df[['country', 'alcohol_rate']].sort_values('alcohol_rate', ascending=False).head(20)

### 대륙별 알콜비율도 계산해서 출력

In [77]:
df.groupby('continent')['alcohol_rate'].sum().sort_values(ascending=False)

continent
AF    2.636258
EU    0.788717
AS    0.719797
OT    0.410644
OC    0.270327
SA    0.214415
Name: alcohol_rate, dtype: float64

In [83]:
df[['country', 'alcohol_rate']].max()

country         Zimbabwe
alcohol_rate    0.266667
dtype: object

In [81]:
### kor 포함되어 있는 나라를 출력
filt = df['country'].str.lower().str.contains('kor')
df[filt][['country', 'alcohol_rate']]

         country  alcohol_rate
46   North Korea      0.000000
138  South Korea      0.059394